In [1]:
import pandas as pd

In [2]:
data = pd.read_excel("IPL.xls")
data.head()

,Match_Number,Match,Date,Year,Venue,Team_Batting_First,Team_Batting_Second,Bat_First_Runs_Scored,Bat_First_Wickets_Lost,Bat_First_Overs_Consumed,...,Bat_Second_10_ov_score,Bat_Second_10_ov_wkts_lost,Bat_Second_10_ov_Req_RR,Bat_Second_15_ov_score,Bat_Second_15_ov_wkts_lost,Bat_Second_15_ov_Req_RR,Bat_Second_20_ov_score,Bat_Second_20_ov_wkts_lost,Match_Time,Duckworth Lewis Used
0,1,League Match,Apr 18,2008,Bangalore,Kolkata,Bangalore,222,3,20.0,...,51.0,7.0,17.2,81.0,9.0,28.4,NaN,NaN,Evening,NaN
1,2,League Match,Apr 19,2008,Mohali,Chennai,Punjab,240,5,20.0,...,110.0,1.0,13.1,165.0,3.0,15.2,207.0,4.0,Afternoon,NaN
2,3,League Match,Apr 19,2008,Delhi,Rajasthan,Delhi,129,8,20.0,...,86.0,1.0,4.4,128.0,1.0,0.4,NaN,NaN,Evening,NaN
3,4,League Match,Apr 20,2008,Kolkata,Hyderabad,Kolkata,110,10,18.4,...,38.0,3.0,7.3,81.0,4.0,6.0,NaN,NaN,Afternoon,NaN
4,5,League Match,Apr 20,2008,Mumbai,Mumbai,Bangalore,165,6,20.0,...,76.0,3.0,9.0,118.0,4.0,9.6,166.0,5.0,Evening,NaN

### Task-1

In [7]:
match_2009 = data[data["Year"]==2009]

In [ ]:
1. Winning_Team
2. Balls_Remaining
3.

In [37]:
close = []
for i in range(2008,2016):
    year = data[data["Year"]==i]
    balls_remaining = year[year["Balls_Remaining"]<=3]
    tie = year[year["Winning_Team"]=="Match Tied"]
    chase_win = year[year["Winner"] == year["Team_Batting_Second"]]
    chase_win_1 = chase_win[chase_win["Winning_Margin"] == 1]
    chase_loose = year[year["Winner"] != year["Team_Batting_Second"]]
    chase_loose_5 = chase_loose[chase_loose["Winning_Margin"] <= 5]
    final = [balls_remaining, tie,chase_win_1,chase_loose_5]
#     print(len(final[0]))   
    close.append(len(final[0]))

In [38]:
close

[28, 33, 28, 35, 46, 39, 33, 39]

In [39]:
index = [i for i in range(2008,2016)]
index

[2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015]

In [40]:
close = pd.DataFrame(data = close,index = index,columns = ["No of mathches"])

In [41]:
close

      No of mathches
2008              28
2009              33
2010              28
2011              35
2012              46
2013              39
2014              33
2015              39

### Task-2

In [42]:
teams = ["Chennai","Hyderabad","Mumbai","Kolkata"]
teams

['Chennai', 'Hyderabad', 'Mumbai', 'Kolkata']

In [52]:
percentages = []
for i in teams:
    bat_first = data[data["Team_Batting_First"] == i]
    bat_first_no = len(bat_first)
    
    bat_first_win = bat_first[bat_first["Winning_Team"]=="FirstBatting"]
    bat_first_win_no = len(bat_first_win)
    per = (bat_first_win_no/bat_first_no)*100
    percentages.append(per)
percentages

[58.44155844155844, 43.66197183098591, 59.42028985507246, 45.45454545454545]

In [53]:
pd.DataFrame(data = percentages,index = teams,columns = ["Percent won batting first"])

           Percent won batting first
Chennai                    58.441558
Hyderabad                  43.661972
Mumbai                     59.420290
Kolkata                    45.454545